// middleware - פונקציה שקורית בין הבקשה לתגובה
// מקבלת נתוני בקשה, תגובה, פונקציית נקסט
// גם הפונקציות בקונטרולר מכונות מידלוואר

// מבצעת
// 1. הדפסות/לוגיקה אחרת - next()
// 2. החזרת תגובה ללקוח - res.send()/res.json()
export const printHello = (req1, res1, next1) => {
    console.log('hello', req1.user2);
    // res1.status(201).send('hello middleware'); // החזרת תגובה ללקוח
    
    // פונקציה שמאפשרת מעבר למידלוואר הבא
    // רק אם לא שלחנו פרמטרים
    next1();
};

// מידלוואר ששולח תאריך התחלת בקשה למידלוואר הבא
// בצורה דומה נוכל לשלוח את היוזר הנוכחי
export const sendDate = (req, res, next) => {
    const now = new Date();
    console.log('sendDate', now);
    
    // כדי לשלוח נתונים למידלוואר הבא
    // נצרף אותם לאוביקט הבקשה/התגובה
    // לאחר מכן נקרא למידלוואר הבא ע"י נקסט ריק - ללא פרמטרים
    req.user2 = 'admin';
    req.currentDate3 = now;
    next(); 

    // כאשר שולחים פרמטרים - הולך לערוץ חדש של שגיאות
    // עוצר תהליך נוכחי
    // next(now);
}